[
    {
        "name": "Barbarian",
        "shortdescription": "A fierce warrior who can enter a battle rage",
        "fulldescription": "A tall human tribesman strides through a blizzard, draped in fur and hefting his axe. He laughs as he charges toward the frost giant who dared poach his people’s elk herd.  \n \n A half-orc snarls at the latest challenger to her authority over their tribe, ready to break his neck with her bare hands as she did to the last six rivals.  \n \n Frothing at the mouth, a dwarf slams his helmet into the face of his drow foe, then turns to drive his armored elbow into the gut of another.  \n \n These barbarians, different as they might be, are defined by their rage: unbridled, unquenchable, and unthinking fury. More than a mere emotion, their anger is the ferocity of a cornered predator, the unrelenting assault of a storm, the churning turmoil of the sea.  \n \n For some, their rage springs from a communion with fierce animal spirits. Others draw from a roiling reservoir of anger at a world full of pain. For every barbarian, rage is a power that fuels not just a battle frenzy but also uncanny reflexes, resilience, and feats of strength.",
        "features": [
            {
                "name": "Rage",
                "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. \n \n While raging, you gain the following benefits if you aren’t wearing heavy armor: \n \n You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. \n If you are able to cast spells, you can’t cast them or concentrate on them while raging. \n \n Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. \n \n Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
            },
            {
                "name": "Unarmored Defense",
                "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
            },
            {
                "name": "Reckless Attack",
                "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
            },
            {
                "name": "Danger Sense",
                "description": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. \n \n You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
            },
            {
                "name": "Primal Path",
                "description": "At 3rd level, you choose a path that shapes the nature of your rage. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Extra Attack",
                "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
            },
            {
                "name": "Fast Movement",
                "description": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor."
            },
            {
                "name": "Feral Instinct",
                "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
            },
            {
                "name": "Brutal Critical",
                "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack."
            },
            {
                "name": "Relentless Rage",
                "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
            },
            {
                "name": "Brutal Critical",
                "description": "At 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
            },
            {
                "name": "Persistent Rage",
                "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
            },
            {
                "name": "Brutal Critical",
                "description": "At 17th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
            },
            {
                "name": "Indomitable Might",
                "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
            },
            {
                "name": "Primal Champion",
                "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Strength",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Constitution",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d12"
    },
    {
        "name": "Bard",
        "shortdescription": "An inspiring magician whose power echoes the music of creation",
        "fulldescription": "Humming as she traces her fingers over an ancient monument in a long-forgotten ruin, a half-elf in rugged leathers finds knowledge springing into her mind, conjured forth by the magic of her song—knowledge of the people who constructed the monument and the mythic saga it depicts. \n \n A stern human warrior bangs his sword rhythmically against his scale mail, setting the tempo for his war chant and exhorting his companions to bravery and heroism. The magic of his song fortifies and emboldens them. \n \n Laughing as she tunes her cittern, a gnome weaves her subtle magic over the assembled nobles, ensuring that her companions’ words will be well received. \n \n Whether scholar, skald, or scoundrel, a bard weaves magic through words and music to inspire allies, demoralize foes, manipulate minds, create illusions, and even heal wounds.",
        "features": [
            {
                "name": "Spellcasting",
                "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations. See Spells Rules for the general rules of spellcasting and the Spells Listing for the bard spell list. \n \n Cantrips - You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table. \n \n Spell Slots - The Bard table shows how many spell slots you have to cast your bard spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. For example, if you know the 1st-level spell cure wounds and have a 1st-level and a 2nd-level spell slot available, you can cast cure wounds using either slot. \n \n Spells Known of 1st Level and Higher - You know four 1st-level spells of your choice from the bard spell list. \n The Spells Known column of the Bard table shows when you learn more bard spells of your choice. Each of these spells must be of a level for which you have spell slots, as shown on the table. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level. \n Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots. \n \n Spellcasting Ability - Charisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Charisma modifier \n \n Spell attack modifier = your proficiency bonus + your Charisma modifier \n \n Ritual Casting - You can cast any bard spell you know as a ritual if that spell has the ritual tag. \n \n Spellcasting Focus- You can use a musical instrument (see the Tools section) as a spellcasting focus for your bard spells."
            },
            {
                "name": "Bardic Inspiration",
                "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. \n \n Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. \n \n You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. \n \n Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
            },
            {
                "name": "Jack of All Trades",
                "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus."
            },
            {
                "name": "Song of Rest",
                "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. \n \n The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
            },
            {
                "name": "Bard College",
                "description": "At 3rd level, you delve into the advanced techniques of a bard college of your choice: the College of Lore detailed at the end of the class description or another from the Player's Handbook or other sources. Your choice grants you features at 3rd level and again at 6th and 14th level."
            },
            {
                "name": "Expertise",
                "description": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Font of Inspiration",
                "description": "BBeginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
            },
            {
                "name": "Brutal Critical",
                "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack."
            },
            {
                "name": "Countercharm",
                "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
            },
            {
                "name": "Expertise",
                "description": "At 10th level, choose two more of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
            },
            {
                "name": "Magical Secrets",
                "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 14th level and again at 18th level."
            },
            {
                "name": "Magical Secrets",
                "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 14th level and again at 18th level."
            },
            {
                "name": "Magical Secrets",
                "description": "At 18th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table."
            },
            {
                "name": "Superior Inspiration",
                "description": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Dexterity",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Charisma",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    },
    {
        "name": "Cleric",
        "shortdescription": "A priestly champion who wields divine magic in service of a higher power",
        "fulldescription": "Arms and eyes upraised toward the sun and a prayer on his lips, an elf begins to glow with an inner light that spills out to heal his battle-worn companions. \n \n Chanting a song of glory, a dwarf swings his axe in wide swaths to cut through the ranks of orcs arrayed against him, shouting praise to the gods with every foe’s fall. \n \n Calling down a curse upon the forces of undeath, a human lifts her holy symbol as light pours from it to drive back the zombies crowding in on her companions. \n \n Clerics are intermediaries between the mortal world and the distant planes of the gods. As varied as the gods they serve, clerics strive to embody the handiwork of their deities. No ordinary priest, a cleric is imbued with divine magic.",
        "features": [
            {
                "name": "Spellcasting",
                "description": "As a conduit for divine power, you can cast cleric spells. See Spells Rules for the general rules of spellcasting and the Spells Listing for the cleric spell list. \n Cantrips At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table. \n Preparing and Casting Spells - The Cleric table shows how many spell slots you have to cast your cleric spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. \n You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots. \n For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells. \n You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n Spellcasting Ability - Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Wisdom modifier \n \n Spell attack modifier = your proficiency bonus + your Wisdom modifier \n \n Ritual Casting - You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared. \n \n Spellcasting Focus - You can use a holy symbol (see the Adventuring Gear section) as a spellcasting focus for your cleric spells."
            },
            {
                "name": "Divine Domain",
                "description": "Choose one domain related to your deity. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels. \n \n Domain Spells -  \n Each domain has a list of spells — its domain spells — that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. \n \n If you have a domain spell that doesn’t appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
            },
            {
                "name": "Channel Divinity",
                "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description. \n \n When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. \n \n Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC. \n \n Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses. Channel Divinity: Turn Undead - As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. \n A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Destroy Undead",
                "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold. Under 5th level, Undead of 1/2 CR or lower are destroyed, Under 8th level, this is increased to 1. At 11th level to 2, 14th level to 3 and finally at 17th level, Undead of CR 4 or lower are destroyed."
            },
            {
                "name": "Divine Intervention",
                "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. \n \n Imploring your deity’s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. \n \n  If your deity intervenes, you can’t use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. \n \n At 20th level, your call for intervention succeeds automatically, no roll required."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Wisdom",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Charisma",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    },
    {
        "name": "Druid",
        "shortdescription": "A priest of the Old Faith, wielding the powers of nature and adopting animal forms",
        "fulldescription": "Holding high a gnarled staff wreathed with holly, an elf summons the fury of the storm and calls down explosive bolts of lightning to smite the torch-carrying orcs who threaten her forest.  \n \n Crouching out of sight on a high tree branch in the form of a leopard, a human peers out of the jungle at the strange construction of a temple of Evil Elemental Air, keeping a close eye on the cultists’ activities. \n \n Swinging a blade formed of pure fire, a half-elf charges into a mass of skeletal soldiers, sundering the unnatural magic that gives the foul creatures the mocking semblance of life. \n \n Whether calling on the elemental forces of nature or emulating the creatures of the animal world, druids are an embodiment of nature’s resilience, cunning, and fury. They claim no mastery over nature. Instead, they see themselves as extensions of nature’s indomitable will.",
        "features": [
            {
                "name": "Druidic",
                "description": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message’s presence with a successful DC 15 Wisdom (Perception) check but can’t decipher it without magic."
            },
            {
                "name": "Spellcasting",
                "description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See Spells Rules for the general rules of spellcasting and the Spells Listing for the druid spell list. \n \n Cantrips - At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table. \n \n Preparing and Casting Spells - The Druid table shows how many spell slots you have to cast your druid spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. \n You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells. \n You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n Spellcasting Ability - Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Wisdom modifier \n \n Spell attack modifier = your proficiency bonus + your Wisdom modifier \n \n Ritual Casting - You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared. \n \n Spellcasting Focus - You can use a druidic focus (see the Adventuring Gear section) as a spellcasting focus for your druid spells."
            },
            {
                "name": "Wild Shape",
                "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. \n \n Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn’t have a flying or swimming speed. At 4th level you can transform into any beast 1/2 CR or lower that does not have a flying speed, and at level 8 you can transform into any beast CR 1 or lower. \n \n You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die. \n \n While you are transformed, the following rules apply: \n \n Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature’s bonus instead of yours. If the creature has any legendary or lair actions, you can’t use them. \n - When you transform, you assume the beast’s hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious. \n - You can’t cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn’t break your concentration on a spell you’ve already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you’ve already cast. \n - You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can’t use any of your special senses, such as darkvision, unless your new form also has that sense. \n - You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature’s shape and size. Your equipment doesn’t change size or shape to match the new form, and any equipment that the new form can’t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."
            },
            {
                "name": "Druid Circle",
                "description": "At 2nd level, you choose to identify with a circle of druids: the Circle of the Land detailed at the end of the class description or one from the Player's Handbook or other sources. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
            },
            {
                "name": "Wild Shape Improvement",
                "description": "At 4th level, you can use your action to magically assume the shape of a beast that you have seen before of challenge rating 1/2 or lower that doesn't have a flying speed. You can use this feature twice. You regain expended uses when you finish a short or long rest."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Wild Shape Improvement",
                "description": "At 8th level, you can use your action to magically assume the shape of a beast that you have seen before of challenge rating 1 or lower. You can use this feature twice. You regain expended uses when you finish a short or long rest."
            },
            {
                "name": "Timeless Body",
                "description": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
            },
            {
                "name": "Beast Spells",
                "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components."
            },
            {
                "name": "Archdruid",
                "description": "At 20th level, you can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren’t consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Intelligence",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Wisdom",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    },
    {
        "name": "Fighter",
        "shortdescription": "A master of martial combat, skilled with a variety of weapons and armor",
        "fulldescription": "A human in clanging plate armor holds her shield before her as she runs toward the massed goblins. An elf behind her, clad in studded leather armor, peppers the goblins with arrows loosed from his exquisite bow. The half-orc nearby shouts orders, helping the two combatants coordinate their assault to the best advantage. \n \n A dwarf in chain mail interposes his shield between the ogre’s club and his companion, knocking the deadly blow aside. His companion, a half-elf in scale armor, swings two scimitars in a blinding whirl as she circles the ogre, looking for a blind spot in its defenses.\n \n A gladiator fights for sport in an arena, a master with his trident and net, skilled at toppling foes and moving them around for the crowd’s delight—and his own tactical advantage. His opponent’s sword flares with blue light an instant before she sends lightning flashing forth to smite him.  \n \n All of these heroes are fighters, perhaps the most diverse class of characters in the worlds of Dungeons & Dragons. Questing knights, conquering overlords, royal champions, elite foot soldiers, hardened mercenaries, and bandit kings—as fighters, they all share an unparalleled mastery with weapons and armor, and a thorough knowledge of the skills of combat. And they are well acquainted with death, both meting it out and staring it defiantly in the face.",
        "features": [
            {
                "name": "Fighting Style",
                "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again. \n \n Archery - You gain a +2 bonus to attack rolls you make with ranged weapons. \n \n Defense - While you are wearing armor, you gain a +1 bonus to AC. \n \n Dueling - When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. \n \n Great Weapon Fighting - When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit. \n \n Protection - When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. \n \n Two-Weapon Fighting - When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
            },
            {
                "name": "Second Wind",
                "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
            },
            {
                "name": "Action Surge",
                "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
            },
            {
                "name": "Martial Archetype",
                "description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Extra Attack",
                "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. \n The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
            },
            {
                "name": "Indomitable",
                "description": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
            },
            {
                "name": "Extra Attack",
                "description": "Beginning at 11th level, you can attack three times, instead of twice, whenever you take the Attack action on your turn. The number of attacks increases to four when you reach 20th level in this class."
            },
            {
                "name": "Extra Attack",
                "description": "At 20th level, you can attack four times, instead of three, whenever you take the Attack action on your turn."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Strength",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Constitution",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d10"
    },
    {
        "name": "Monk",
        "shortdescription": "A master of martial arts, harnessing the power of the body in pursuit of physical and spiritual perfection",
        "fulldescription": "Her fists a blur as they deflect an incoming hail of arrows, a half-elf springs over a barricade and throws herself into the massed ranks of hobgoblins on the other side. She whirls among them, knocking their blows aside and sending them reeling, until at last she stands alone. \n \n Taking a deep breath, a human covered in tattoos settles into a battle stance. As the first charging orcs reach him, he exhales and a blast of fire roars from his mouth, engulfing his foes. \n \n Moving with the silence of the night, a black-clad halfling steps into a shadow beneath an arch and emerges from another inky shadow on a balcony a stone’s throw away. She slides her blade free of its cloth-wrapped scabbard and peers through the open window at the tyrant prince, so vulnerable in the grip of sleep. \n \n Whatever their discipline, monks are united in their ability to magically harness the energy that flows in their bodies. Whether channeled as a striking display of combat prowess or a subtler focus of defensive ability and speed, this energy infuses all that a monk does.",
        "features": [
            {
                "name": "Unarmored Defense",
                "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
            },
            {
                "name": "Martial Arts",
                "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don’t have the two-handed or heavy property. \n \n You gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor or wielding a shield: \n \n - You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons. \n - You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table. \n - When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven’t already taken a bonus action this turn. \n - Certain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon in the Weapons section."
            },
            {
                "name": "Ki",
                "description": "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table. You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class. \n \n When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.Some of your ki features require your target to make a saving throw to resist the feature’s effects. The saving throw DC is calculated as follows: \n \n Ki save DC = 8 + your proficiency bonus + your Wisdom modifier \n \n Flurry of Blows - Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action. \n Patient Defense - You can spend 1 ki point to take the Dodge action as a bonus action on your turn. \n Step of the Wind - You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
            },
            {
                "name": "Unarmored Movement",
                "description": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table. At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
            },
            {
                "name": "Monastic Tradition",
                "description": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way of the Open Hand, detailed at the end of the class description or one from another source. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."
            },
            {
                "name": "Deflect Missiles",
                "description": "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level. \n \n If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack, which has a normal range of 20 feet and a long range of 60 feet."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Slow Fall",
                "description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
            },
            {
                "name": "Extra Attack",
                "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
            },
            {
                "name": "Stunning Strike",
                "description": "Starting at 5th level, you can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."
            },
            {
                "name": "Ki-Empowered Strikes",
                "description": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
            },
            {
                "name": "Unarmored Movement",
                "description": "At 6th level, your Unarmored Speed speed bonus increases to 15 feet while you are not wearing armor or wielding a shield."
            },
            {
                "name": "Evasion",
                "description": "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon’s lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
            },
            {
                "name": "Stillness of Mind",
                "description": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened."
            },
            {
                "name": "Unarmored Movement Improvement",
                "description": "At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during your move."
            },
            {
                "name": "Purity of Body",
                "description": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison."
            },
            {
                "name": "Unarmored Movement",
                "description": "At 10th level, your Unarmored Speed speed bonus increases to 20 feet while you are not wearing armor or wielding a shield."
            },
            {
                "name": "Tongue of the Sun and Moon",
                "description": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
            },
            {
                "name": "Diamond Soul",
                "description": "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws. Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
            },
            {
                "name": "Unarmored Movement",
                "description": "At 14th level, your Unarmored Speed speed bonus increases to 25 feet while you are not wearing armor or wielding a shield."
            },
            {
                "name": "Timeless Body",
                "description": "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can’t be aged magically. You can still die of old age, however. In addition, you no longer need food or water."
            },
            {
                "name": "Empty Body",
                "description": "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. \n \n Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you."
            },
            {
                "name": "Unarmored Movement",
                "description": "At 18th level, your Unarmored Speed speed bonus increases to 30 feet while you are not wearing armor or wielding a shield."
            },
            {
                "name": "Perfect Self",
                "description": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Dexterity",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Wisdom",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    },
    {
        "name": "Paladin",
        "shortdescription": "A holy warrior bound to a sacred oath",
        "fulldescription": "Clad in plate armor that gleams in the sunlight despite the dust and grime of long travel, a human lays down her sword and shield and places her hands on a mortally wounded man. Divine radiance shines from her hands, the man’s wounds knit closed, and his eyes open wide with amazement. \n \n A dwarf crouches behind an outcrop, his black cloak making him nearly invisible in the night, and watches an orc war band celebrating its recent victory. Silently, he stalks into their midst and whispers an oath, and two orcs are dead before they even realize he is there. \n \n Silver hair shining in a shaft of light that seems to illuminate only him, an elf laughs with exultation. His spear flashes like his eyes as he jabs again and again at a twisted giant, until at last his light overcomes its hideous darkness. \n \n Whatever their origin and their mission, paladins are united by their oaths to stand against the forces of evil. Whether sworn before a god’s altar and the witness of a priest, in a sacred glade before nature spirits and fey beings, or in a moment of desperation and grief with the dead as the only witness, a paladin’s oath is a powerful bond. It is a source of power that turns a devout warrior into a blessed champion.",
        "features": [
            {
                "name": "Divine Sense",
                "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. \n \n You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
            },
            {
                "name": "Lay on Hands",
                "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. \n \n As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. \n \n Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead and constructs."
            },
            {
                "name": "Fighting Style",
                "description": "At 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again. \n \n Defense - While you are wearing armor, you gain a +1 bonus to AC.      \n Dueling - When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.  \n Great Weapon Fighting - When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit. \n Protection - When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."
            },
            {
                "name": "Spellcasting",
                "description": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See Spells Rules for the general rules of spellcasting and the Spells Listing for the paladin spell list. \n \n Preparing and Casting Spells - The Paladin table shows how many spell slots you have to cast your paladin spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. \n \n You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells. \n \n You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n Spellcasting Ability - Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Charisma modifier \n \n Spell attack modifier = your proficiency bonus + your Charisma modifier \n \n Spellcasting Focus - You can use a holy symbol (see the Adventuring Gear section) as a spellcasting focus for your paladin spells."
            },
            {
                "name": "Divine Smite",
                "description": "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon’s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."
            },
            {
                "name": "Divine Health",
                "description": "By 3rd level, the divine magic flowing through you makes you immune to disease."
            },
            {
                "name": "Sacred Oath",
                "description": "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose the Oath of Devotion detailed at the end of the class description or one from another source. Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature."
            },
            {
                "name": "Oath Spells",
                "description": "Each oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don’t count against the number of spells you can prepare each day. If you gain an oath spell that doesn’t appear on the paladin spell list, the spell is nonetheless a paladin spell for you."
            },
            {
                "name": "Channel Divinity",
                "description": "Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it. \n \n When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again. \n \n Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Extra Attack",
                "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
            },
            {
                "name": "Aura of Protection",
                "description": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet."
            },
            {
                "name": "Aura of Courage",
                "description": "Starting at 10th level, you and friendly creatures within 10 feet of you can’t be frightened while you are conscious. At 18th level, the range of this aura increases to 30 feet."
            },
            {
                "name": "Improved Divine Smite",
                "description": "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage."
            },
            {
                "name": "Cleansing Touch",
                "description": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
            },
            {
                "name": "Aura Improvements",
                "description": "At 18th level, the range of your auras increase to 30 feet."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Strength",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Charisma",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d10"
    },
    {
        "name": "Ranger",
        "shortdescription": "A warrior who combats threats on the edges of civilization",
        "fulldescription": "Rough and wild looking, a human stalks alone through the shadows of trees, hunting the orcs he knows are planning a raid on a nearby farm. Clutching a shortsword in each hand, he becomes a whirlwind of steel, cutting down one enemy after another. \n \n After tumbling away from a cone of freezing air, an elf finds her feet and draws back her bow to loose an arrow at the white dragon. Shrugging off the wave of fear that emanates from the dragon like the cold of its breath, she sends one arrow after another to find the gaps between the dragon’s thick scales. \n \n Holding his hand high, a half-elf whistles to the hawk that circles high above him, calling the bird back to his side. Whispering instructions in Elvish, he points to the owlbear he’s been tracking and sends the hawk to distract the creature while he readies his bow. \n \n Far from the bustle of cities and towns, past the hedges that shelter the most distant farms from the terrors of the wild, amid the dense-packed trees of trackless forests and across wide and empty plains, rangers keep their unending watch.",
        "features": [
            {
                "name": "Favored Enemy",
                "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. \n \n Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies. \n \n You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. \n \n When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all. \n \n You choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures."
            },
            {
                "name": "Natural Explorer",
                "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in.\n \n While traveling for an hour or more in your favored terrain, you gain the following benefits: \n \n - Difficult terrain doesn’t slow your group’s travel. \n - Your group can’t become lost except by magical means. \n - Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger. \n - If you are traveling alone, you can move stealthily at a normal pace. \n - When you forage, you find twice as much food as you normally would. \n - While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area. \n \n You choose additional favored terrain types at 6th and 10th level."
            },
            {
                "name": "Fighting Style",
                "description": "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again. \n \n Archery - You gain a +2 bonus to attack rolls you make with ranged weapons.\n Defense - While you are wearing armor, you gain a +1 bonus to AC.\n Dueling - When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. \n Two-Weapon Fighting - When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
            },
            {
                "name": "Spellcasting",
                "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See Spells Rules for the general rules of spellcasting and the Spells Listing for the ranger spell list. \n \n Spell Slots - The Ranger table shows how many spell slots you have to cast your ranger spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. For example, if you know the 1st-level spell animal friendship and have a 1st-level and a 2nd-level spell slot available, you can cast animal friendship using either slot. \n \n Spells Known of 1st Level and Higher - You know two 1st-level spells of your choice from the ranger spell list. \n \n The Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level. Additionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots. \n \n Spellcasting Ability - Wisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Wisdom modifier \n \n Spell attack modifier = your proficiency bonus + your Wisdom modifier"
            },
            {
                "name": "Ranger Archetype",
                "description": "At 3rd level, you choose an archetype that you strive to emulate: the Hunter that is detailed at the end of the class description or one from another source. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level."
            },
            {
                "name": "Primeval Awareness",
                "description": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Extra Attack",
                "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
            },
            {
                "name": "Land’s Stride",
                "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. \n \n In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."
            },
            {
                "name": "Hide in Plain Sight",
                "description": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. \n \n Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit."
            },
            {
                "name": "Vanish",
                "description": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail."
            },
            {
                "name": "Feral Senses",
                "description": "At 18th level, you gain preternatural senses that help you fight creatures you can’t see. When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it. \n \n You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened."
            },
            {
                "name": "Foe Slayer",
                "description": "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Dexterity",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Wisdom",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d10"
    },
    {
        "name": "Rogue",
        "shortdescription": "A scoundrel who uses stealth and trickery to overcome obstacles and enemies",
        "fulldescription": "Signaling for her companions to wait, a halfling creeps forward through the dungeon hall. She presses an ear to the door, then pulls out a set of tools and picks the lock in the blink of an eye. Then she disappears into the shadows as her fighter friend moves forward to kick the door open.  \n \n A human lurks in the shadows of an alley while his accomplice prepares for her part in the ambush. When their target — a notorious slaver — passes the alleyway, the accomplice cries out, the slaver comes to investigate, and the assassin’s blade cuts his throat before he can make a sound. \n \n Suppressing a giggle, a gnome waggles her fingers and magically lifts the key ring from the guard’s belt. In a moment, the keys are in her hand, the cell door is open, and she and her companions are free to make their escape. \n \n Rogues rely on skill, stealth, and their foes’ vulnerabilities to get the upper hand in any situation. They have a knack for finding the solution to just about any problem, demonstrating a resourcefulness and versatility that is the cornerstone of any successful adventuring party.",
        "features": [
            {
                "name": "Expertise",
                "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves’ tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 6th level, you can choose two more of your proficiencies (in skills or with thieves’ tools) to gain this benefit."
            },
            {
                "name": "Sneak Attack",
                "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. \n \n You don’t need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage on the attack roll. The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table."
            },
            {
                "name": "Thieves’ Cant",
                "description": "During your rogue training you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. \n \n In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves’ guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
            },
            {
                "name": "Cunning Action",
                "description": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
            },
            {
                "name": "Roguish Archetype",
                "description": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities: Thief, detailed at the end of the class description, or one from another source. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Uncanny Dodge",
                "description": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you."
            },
            {
                "name": "Expertise",
                "description": "At 6th level, choose two more of your skill proficiencies, or one more of your skill proficiencies and your proficiency with thieves’ tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
            },
            {
                "name": "Evasion",
                "description": "Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as an ancient red dragon’s fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
            },
            {
                "name": "Reliable Talent",
                "description": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
            },
            {
                "name": "Blindsense",
                "description": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."
            },
            {
                "name": "Slippery Mind",
                "description": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."
            },
            {
                "name": "Elusive",
                "description": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren’t incapacitated."
            },
            {
                "name": "Stroke of Luck",
                "description": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can’t use it again until you finish a short or long rest."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Dexterity",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Intelligence",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    },
    {
        "name": "Sorcerer",
        "shortdescription": "A spellcaster who draws on inherent magic from a gift or bloodline",
        "fulldescription": "Golden eyes flashing, a human stretches out her hand and unleashes the dragonfire that burns in her veins. As an inferno rages around her foes, leathery wings spread from her back and she takes to the air. \n \n Long hair whipped by a conjured wind, a half-elf spreads his arms wide and throws his head back. Lifting him momentarily off the ground, a wave of magic surges up in him, through him, and out from him in a mighty blast of lightning. \n \n Crouching behind a stalagmite, a halfling points a finger at a charging troglodyte. A blast of fire springs from her finger to strike the creature. She ducks back behind the rock formation with a grin, unaware that her wild magic has turned her skin bright blue. \n \n Sorcerers carry a magical birthright conferred upon them by an exotic bloodline, some otherworldly influence, or exposure to unknown cosmic forces. One can’t study sorcery as one learns a language, any more than one can learn to live a legendary life. No one chooses sorcery; the power chooses the sorcerer.",
        "features": [
            {
                "name": "Spellcasting",
                "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. See Spells Rules for the general rules of spellcasting and the Spells Listing for the sorcerer spell list. \n \n Cantrips - At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table. \n \n Spell Slots - The Sorcerer table shows how many spell slots you have to cast your sorcerer spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. For example, if you know the 1st-level spell burning hands and have a 1st-level and a 2nd-level spell slot available, you can cast burning hands using either slot. \n \n Spells Known of 1st Level and Higher - You know two 1st-level spells of your choice from the sorcerer spell list. \n \n The Spells Known column of the Sorcerer table shows when you learn more sorcerer spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level. Additionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots. \n \n Spellcasting Ability - Charisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.\n \n Spell save DC = 8 + your proficiency bonus + your Charisma modifier \n \n Spell attack modifier = your proficiency bonus + your Charisma modifier \n \n Spellcasting Focus - You can use an arcane focus (see the Adventuring Gear section) as a spellcasting focus for your sorcerer spells."
            },
            {
                "name": "Sorcerous Origin",
                "description": "Choose a sorcerous origin, which describes the source of your innate magical power: Draconic Bloodline, detailed at the end of the class description, or one from another source. Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level."
            },
            {
                "name": "Font of Magic",
                "description": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects. \n \n Sorcery Points - You have 2 sorcery points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer table. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest. \n \n Flexible Casting - You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels. \n \n Creating Spell Slots. You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th. Any spell slot you create with this feature vanishes when you finish a long rest. \n \n <table><tr><th>Spell Slot Level</th><th>Sorcery Point Cost</th></tr><tr><td>1st</td><td>2</td></tr><tr><td>2nd</td><td>3</td></tr><tr><td>3rd</td><td>5</td></tr><tr><td>4th</td><td>6</td></tr><tr><td>5tht</td><td>7</td></tr></table>\n \n Converting a Spell Slot to Sorcery Points. As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot’s level."
            },
            {
                "name": "Metamagic",
                "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level. \n \n You can use only one Metamagic option on a spell when you cast it, unless otherwise noted. \n \n Careful Spell - When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell’s full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell. \n \n Distant Spell - When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell. When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet. \n \n Empowered Spell - When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.You can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell. \n \n Extended Spell - When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours. \n \n Heightened Spell - When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell. \n \n Quickened Spell - When you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting. \n \n Subtle Spell - When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components. \n \n Twinned Spell - When you cast a spell that targets only one creature and doesn’t have a range of self, you can spend a number of sorcery points equal to the spell’s level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip). To be eligible, a spell must be incapable of targeting more than one creature at the spell’s current level."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Sorcerous Restoration",
                "description": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Constitution",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Intelligence",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d6"
    },
    {
        "name": "Warlock",
        "shortdescription": "A wielder of magic that is derived from a bargain with an extraplanar entity",
        "fulldescription": "With a pseudodragon curled on his shoulder, a young elf in golden robes smiles warmly, weaving a magical charm into his honeyed words and bending the palace sentinel to his will. \n \n As flames spring to life in her hands, a wizened human whispers the secret name of her demonic patron, infusing her spell with fiendish magic. \n \n Shifting his gaze between a battered tome and the odd alignment of the stars overhead, a wild-eyed tiefling chants the mystic ritual that will open a doorway to a distant world. \n \n Warlocks are seekers of the knowledge that lies hidden in the fabric of the multiverse. Through pacts made with mysterious beings of supernatural power, warlocks unlock magical effects both subtle and spectacular. Drawing on the ancient knowledge of beings such as fey nobles, demons, devils, hags, and alien entities of the Far Realm, warlocks piece together arcane secrets to bolster their own power.",
        "features": [
            {
                "name": "Otherworldly Patron",
                "description": "At 1st level, you have struck a bargain with an otherworldly being of your choice: the Fiend, which is detailed at the end of the class description, or one from another source. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."
            },
            {
                "name": "Pact Magic",
                "description": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells. See Spells Rules for the general rules of spellcasting and the Spells Listing for the warlock spell list. \n \n Cantrips - You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table. \n \n Spell Slots - The Warlock table shows how many spell slots you have to cast your warlock spells of 1st through 5th level. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended Pact Magic spell slots when you finish a short or long rest. For example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell witch bolt, you must spend one of those slots, and you cast it as a 3rd-level spell. \n \n Spells Known of 1st Level and Higher - At 1st level, you know two 1st-level spells of your choice from the warlock spell list. The Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level and higher. A spell you choose must be of a level no higher than what’s shown in the table’s Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level. Additionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots. \n \n Spellcasting Ability - Charisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Charisma modifier \n \n Spell attack modifier = your proficiency bonus + your Charisma modifier \n \n Spellcasting Focus - You can use an arcane focus (see the Adventuring Gear section) as a spellcasting focus for your warlock spells."
            },
            {
                "name": "Eldritch Invocations",
                "description": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. \n \n At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. If an eldritch invocation has prerequisites, you must meet them to learn it. You can learn the invocation at the same time that you meet its prerequisites. A level prerequisite refers to your level in this class. \n \n Agonizing Blast \n Prerequisite: eldritch blast cantrip \n \n When you cast eldritch blast, add your Charisma modifier to the damage it deals on a hit. \n \n Armor of Shadows \n \n You can cast mage armor on yourself at will, without expending a spell slot or material components. \n \n Ascendant Step \n Prerequisite: 9th level \n \n You can cast levitate on yourself at will, without expending a spell slot or material components. \n \n Aspect of the Moon \n Prerequisite: Pact of the Tome feature \n \n You no longer need to sleep and can’t be forced to sleep by any means. To gain the benefits of a long rest, you can spend all 8 hours doing light activity, such as reading your Book of Shadows and keeping watch. \n \n Beast Speech \n \n You can cast speak with animals at will, without expending a spell slot. \n \n Beguiling Influence \n \n You gain proficiency in the Deception and Persuasion skills. \n \n Bewitching Whispers \n Prerequisite: 7th level \n \n You can cast compulsion once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Bond of the Talisman \n Prerequisite: 12th-level warlock, Pact of the Talisman feature \n \n While someone else is wearing your talisman, you can use your action to teleport to the unoccupied space closest to them, provided the two of you are on the same plane of existence. The wearer of your talisman can do the same thing, using their action to teleport to you. The teleportation can be used a number of times equal to your proficiency bonus, and all expended uses are restored when you finish a long rest. \n \n Book of Ancient Secrets \n Prerequisite: Pact of the Tome feature \n \n You can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class’s spell list (the two needn’t be from the same list). The spells appear in the book and don’t count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can’t cast the spells except as rituals, unless you’ve learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag. On your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell’s level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it. \n \n Chains of Carceri \n Prerequisite: 15th level, Pact of the Chain feature \n \n You can cast hold monster at will — targeting a celestial, fiend, or elemental — without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again. \n \n Cloak of Flies \n Prerequisite: 5th level \n \n As a bonus action, you can surround yourself with a magical aura that looks like buzzing flies. The aura extends 5 feet from you in every direction, but not through total cover. It lasts until you’re incapacitated or you dismiss it as a bonus action. The aura grants you advantage on Charisma (Intimidation) checks but disadvantage on all other Charisma checks. Any other creature that starts its turn in the aura takes poison damage equal to your Charisma modifier (minimum of 0 damage). Once you use this invocation, you can’t use it again until you finish a short or long rest. \n \n Devil’s Sight \n \n You can see normally in darkness, both magical and nonmagical, to a distance of 120 feet. \n \n Dreadful Word \n Prerequisite: 7th level \n \n You can cast confusion once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Eldritch Mind \n \n You have advantage on Constitution saving throws that you make to maintain your concentration on a spell. \n \n Eldritch Sight \n \n You can cast detect magic at will, without expending a spell slot. \n \n Eldritch Smite \n Prerequisite: 5th level, Pact of the Blade feature \n \n Once per turn when you hit a creature with your pact weapon, you can expend a warlock spell slot to deal an extra 1d8 force damage to the target, plus another 1d8 per level of the spell slot, and you can knock the target prone if it is Huge or smaller. \n \n Eldritch Spear \n Prerequisite: eldritch blast cantrip \n \n When you cast eldritch blast, its range is 300 feet. \n \n Eyes of the Rune Keeper \n \n You can read all writing. \n \n Far Scribe \n Prerequisite: 5th-level warlock, Pact of the Tome feature \n \n A new page appears in your Book of Shadows. With your permission, a creature can use its action to write its name on that page, which can contain a number of names equal to your proficiency bonus. You can cast the sending spell, targeting a creature whose name is on the page, without using a spell slot and without using material components. To do so, you must write the message on the page. The target hears the message in their mind, and if the target replies, their message appears on the page, rather than in your mind. The writing disappears after 1 minute. As an action, you can magically erase a name on the page by touching it. \n \n Fiendish Vigor \n \n You can cast false life on yourself at will as a 1st-level spell, without expending a spell slot or material components. \n \n Gaze of Two Minds \n \n You can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature’s senses, you benefit from any special senses possessed by that creature, and you are blinded and deafened to your own surroundings. \n \n Ghostly Gaze \n Prerequisite: 7th level \n \n As an action, you gain the ability to see through solid objects to a range of 30 feet. Within that range, you have darkvision if you don’t already have it. This special sight lasts for 1 minute or until your concentration ends (as if you were concentrating on a spell). During that time, you perceive objects as ghostly, transparent images. Once you use this invocation, you can’t use it again until you finish a short or long rest. \n \n Gift of the Depths \n Prerequisite: 5th level \n \n You can breathe underwater, and you gain a swimming speed equal to your walking speed. You can also cast water breathing once without expending a spell slot. You regain the ability to do so when you finish a long rest.\n \n Gift of the Ever-Living Ones \n Prerequisite: Pact of the Chain feature \n \n Whenever you regain hit points while your familiar is within 100 feet of you, treat any dice rolled to determine the hit points you regain as having rolled their maximum value for you. \n \n Gift of the Protectors \n Prerequisite: 9th-level warlock, Pact of the Tome feature \n \n A new page appears in your Book of Shadows. With your permission, a creature can use its action to write its name on that page, which can contain a number of names equal to your proficiency bonus. When any creature whose name is on the page is reduced to 0 hit points but not killed outright, the creature magically drops to 1 hit point instead. Once this magic is triggered, no creature can benefit from it until you finish a long rest. As an action, you can magically erase a name on the page by touching it. \n \n Grasp of Hadar \n Prerequisite: eldritch blast cantrip \n \n Once on each of your turns when you hit a creature with your eldritch blast, you can move that creature in a straight line 10 feet closer to you. \n \n Improved Pact Weapon \n Prerequisite: Pact of the Blade feature \n \n You can use any weapon you summon with your Pact of the Blade feature as a spellcasting focus for your warlock spells. In addition, the weapon gains a +1 bonus to its attack and damage rolls, unless it is a magic weapon that already has a bonus to those rolls. Finally, the weapon you conjure can be a shortbow, longbow, light crossbow, or heavy crossbow. \n \n Investment of the Chain Master \n Prerequisite: Pact of the Chain feature \n \n When you cast find familiar, you infuse the summoned familiar with a measure of your eldritch power, granting the creature the following benefits: \n \n - The familiar gains either a flying speed or a swimming speed (your choice) of 40 feet. \n - As a bonus action, you can command the familiar to take the Attack action. \n - The familiar’s weapon attacks are considered magical for the purpose of overcoming immunity and resistance to nonmagical attacks. \n - If the familiar forces a creature to make a saving throw, it uses your spell save DC. \n - When the familiar takes damage, you can use your reaction to grant it resistance against that damage. \n \n Lance of Lethargy \n Prerequisite: eldritch blast cantrip \n \n Once on each of your turns when you hit a creature with your eldritch blast, you can reduce that creature’s speed by 10 feet until the end of your next turn. \n \n Lifedrinker \n Prerequisite: 12th level, Pact of the Blade feature \n \n When you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum 1). \n \n Maddening Hex \n Prerequisite: 5th level, hex spell or a warlock feature that curses \n \n As a bonus action, you cause a psychic disturbance around the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade’s Curse or Sign of Ill Omen. When you do so, you deal psychic damage to the cursed target and each creature of your choice that you can see within 5 feet of it. The psychic damage equals your Charisma modifier (minimum of 1 damage). To use this invocation, you must be able to see the cursed target, and it must be within 30 feet of you. \n \n Mask of Many Faces \n \n You can cast disguise self at will, without expending a spell slot. \n \n Master of Myriad Forms \n Prerequisite: 15th level \n \n You can cast alter self at will, without expending a spell slot. \n \n Minions of Chaos \n Prerequisite: 9th level \n \n You can cast conjure elemental once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Mire the Mind \n Prerequisite: 5th level \n \n You can cast slow once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Misty Visions \n \n You can cast silent image at will, without expending a spell slot or material components. \n \n One with Shadows \n Prerequisite: 5th level \n \n When you are in an area of dim light or darkness, you can use your action to become invisible until you move or take an action or a reaction. \n \n Otherworldly Leap \n Prerequisite: 9th level \n \n You can cast jump on yourself at will, without expending a spell slot or material components. \n \n Protection of the Talisman \n Prerequisite: 7th-level warlock, Pact of the Talisman feature \n \n When the wearer of your talisman fails a saving throw, they can add a d4 to the roll, potentially turning the save into a success. This benefit can be used a number of times equal to your proficiency bonus, and all expended uses are restored when you finish a long rest. \n \n Rebuke of the Talisman \n Prerequisite: Pact of the Talisman feature \n \n When the wearer of your talisman is hit by an attacker you can see within 30 feet of you, you can use your reaction to deal psychic damage to the attacker equal to your proficiency bonus and push it up to 10 feet away from the talisman’s wearer. \n \n Relentless Hex \n Prerequisite: 7th level, hex spell or a warlock feature that curses \n \n Your curse creates a temporary bond between you and your target. As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see within 5 feet of the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade’s Curse or Sign of Ill Omen. To teleport in this way, you must be able to see the cursed target. \n \n Repelling Blast \n Prerequisite: eldritch blast cantrip \n \n When you hit a creature with eldritch blast, you can push the creature up to 10 feet away from you in a straight line. \n \n Sculptor of Flesh \n Prerequisite: 7th level \n \n You can cast polymorph once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Shroud of Shadow \n Prerequisite: 15th level \n \n You can cast invisibility at will, without expending a spell slot. \n \n Sign of Ill Omen \n Prerequisite: 5th level \n \n You can cast bestow curse once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Thief of Five Fates \n \n You can cast bane once using a warlock spell slot. You can’t do so again until you finish a long rest. \n \n Thirsting Blade \n Prerequisite: 5th level, Pact of the Blade feature \n \n You can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn. \n \n Tomb of Levistus \n Prerequisite: 5th level \n \n As a reaction when you take damage, you can entomb yourself in ice, which melts away at the end of your next turn. You gain 10 temporary hit points per warlock level, which take as much of the triggering damage as possible. Immediately after you take the damage, you gain vulnerability to fire damage, your speed is reduced to 0, and you are incapacitated. These effects, including any remaining temporary hit points, all end when the ice melts. Once you use this invocation, you can’t use it again until you finish a short or long rest. \n \n Trickster's Escape \n Prerequisite: 7th level \n \n You can cast freedom of movement once on yourself without expending a spell slot. You regain the ability to do so when you finish a long rest. \n \n Undying Servitude \n Prerequisite: 5th-level warlock \n \n You can cast animate dead without using a spell slot. Once you do so, you can’t cast it in this way again until you finish a long rest. \n \n Visions of Distant Realms \n Prerequisite: 15th level \n \n You can cast arcane eye at will, without expending a spell slot. \n \n Voice of the Chain Master \n Prerequisite: Pact of the Chain feature \n \n You can communicate telepathically with your familiar and perceive through your familiar’s senses as long as you are on the same plane of existence. Additionally, while perceiving through your familiar’s senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech. \n \n Whispers of the Grave \n Prerequisite: 9th level \n \n You can cast speak with dead at will, without expending a spell slot. \n \n Witch Sight \n Prerequisite: 15th level \n \n You can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Mystic Arcanum (6th level)",
                "description": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. \n \n At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
            },
            {
                "name": "Mystic Arcanum (7th level)",
                "description": "At 13th level, your patron bestows upon you a magical secret called an arcanum. Choose one 7th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. \n \n At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
            },
            {
                "name": "Mystic Arcanum (8th level)",
                "description": "At 15th level, your patron bestows upon you a magical secret called an arcanum. Choose one 8th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. \n \n At 17th level, you gain a 9th-level warlock spell of your choice that can be cast in this way. You regain all uses of your Mystic Arcanum when you finish a long rest."
            },
            {
                "name": "Mystic Arcanum (9th level)",
                "description": "At 17th level, your patron bestows upon you a magical secret called an arcanum. Choose one 9th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. You regain all uses of your Mystic Arcanum when you finish a long rest."
            },
            {
                "name": "Eldritch Master",
                "description": "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Wisdom",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Charisma",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    },
    {
        "name": "Wizard",
        "shortdescription": "A scholarly magic-user capable of manipulating the structures of reality",
        "fulldescription": "Clad in the silver robes that denote her station, an elf closes her eyes to shut out the distractions of the battlefield and begins her quiet chant. Fingers weaving in front of her, she completes her spell and launches a tiny bead of fire toward the enemy ranks, where it erupts into a conflagration that engulfs the soldiers. \n \n Checking and rechecking his work, a human scribes an intricate magic circle in chalk on the bare stone floor, then sprinkles powdered iron along every line and graceful curve. When the circle is complete, he drones a long incantation. A hole opens in space inside the circle, bringing a whiff of brimstone from the otherworldly plane beyond. \n \n Crouching on the floor in a dungeon intersection, a gnome tosses a handful of small bones inscribed with mystic symbols, muttering a few words of power over them. Closing his eyes to see the visions more clearly, he nods slowly, then opens his eyes and points down the passage to his left. m\n \n Wizards are supreme magic-users, defined and united as a class by the spells they cast. Drawing on the subtle weave of magic that permeates the cosmos, wizards cast spells of explosive fire, arcing lightning, subtle deception, and brute-force mind control. Their magic conjures monsters from other planes of existence, glimpses the future, or turns slain foes into zombies. Their mightiest spells change one substance into another, call meteors down from the sky, or open portals to other worlds.",
        "features": [
            {
                "name": "Spellcasting",
                "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. See Spells Rules for the general rules of spellcasting and the Spells Listing for the wizard spell list. \n \n Cantrips - At 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table. \n \n Spellbook - At 1st level, you have a spellbook containing six 1st-level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind. \n \n Preparing and Casting Spells - The Wizard table shows how many spell slots you have to cast your wizard spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. \n \n You prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you’re a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell magic missile, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells. \n \n You can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list. \n \n Spellcasting Ability - Intelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one. \n \n Spell save DC = 8 + your proficiency bonus + your Intelligence modifier \n \n Spell attack modifier = your proficiency bonus + your Intelligence modifier \n \n Ritual Casting - You can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don’t need to have the spell prepared. \n \n Spellcasting Focus - You can use an arcane focus (see the Adventuring Gear section) as a spellcasting focus for your wizard spells. \n \n Learning Spells of 1st Level and Higher - Each time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see the “Your Spellbook” sidebar)."
            },
            {
                "name": "Arcane Recovery",
                "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher. For example, if you’re a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots."
            },
            {
                "name": "Arcane Tradition",
                "description": "When you reach 2nd level, you choose an arcane tradition, shaping your practice of magic through one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation. The School of Evocation is detailed at the end of the class description, and more choices are available in other sources. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Spell Mastery",
                "description": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
            },
            {
                "name": "Signature Spells",
                "description": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can’t do so again until you finish a short or long rest. If you want to cast either spell at a higher level, you must expend a spell slot as normal."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Intelligence",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Wisdom",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d6"
    },
    {
        "name": "Artificer",
        "shortdescription": "Masters of invention, artificers use ingenuity and magic to unlock extraordinary capabilities in objects",
        "fulldescription": "Masters of invention, artificers use ingenuity and magic to unlock extraordinary capabilities in objects. They see magic as a complex system waiting to be decoded and then harnessed in their spells and inventions. You can find everything you need to play one of these inventors in the next few sections. \n \n Artificers use a variety of tools to channel their arcane power. To cast a spell, an artificer might use alchemist’s supplies to create a potent elixir, calligrapher’s supplies to inscribe a sigil of power, or tinker’s tools to craft a temporary charm. The magic of artificers is tied to their tools and their talents, and few other characters can produce the right tool for a job as well as an artificer.",
        "features": [
            {
                "name": "Magical Tinkering",
                "description": "At 1st level, you learn how to invest a spark of magic into mundane objects. To use this ability, you must have thieves’ tools or artisan’s tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:  \n \n - The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet. \n - Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long. \n - The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away. \n - A static visual effect appears on one of the object’s surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like. \n \n The chosen property lasts indefinitely. As an action, you can touch the object and end the property early. \n \n You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
            },
            {
                "name": "Spellcasting",
                "description": "You’ve studied the workings of magic and how to cast spells, channeling the magic through objects. To observers, you don’t appear to be casting spells in a conventional way; you appear to produce wonders from mundane items and outlandish inventions. \n \n Tools Required - You produce your artificer spell effects through your tools. You must have a spellcasting focus—specifically thieves’ tools or some kind of artisan’s tool—in hand when you cast any spell with this Spellcasting feature (meaning the spell has an ‘M’ component when you cast it). You must be proficient with the tool to use it in this way. See chapter 5, “Equipment,” in the Player’s Handbook for descriptions of these tools. \n \n After you gain the Infuse Item feature at 2nd level, you can also use any item bearing one of your infusions as a spellcasting focus. \n \n Cantrips - At 1st level, you know two cantrips of your choice from the artificer spell list. At higher levels, you learn additional artificer cantrips of your choice, as shown in the Cantrips Known column of the Artificer table. \n \n When you gain a level in this class, you can replace one of the artificer cantrips you know with another cantrip from the artificer spell list. \n \n Preparing and Casting Spells - The Artificer table shows how many spell slots you have to cast your artificer spells. To cast one of your artificer spells of 1st level or higher, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. \n \n You prepare the list of artificer spells that are available for you to cast, choosing from the artificer spell list. When you do so, choose a number of artificer spells equal to your Intelligence modifier + half your artificer level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots. For example, if you are a 5th-level artificer, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells. \n \n You can change your list of prepared spells when you finish a long rest. Preparing a new list of artificer spells requires time spent tinkering with your spellcasting focuses: at least 1 minute per spell level for each spell on your list."
            },
            {
                "name": "Infuse Item",
                "description": "At 2nd level, you gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items. \n \n Infusions Known - When you gain this feature, pick four artificer infusions to learn, choosing from the “Artificer Infusions” section at the end of the class’s description. You learn additional infusions of your choice when you reach certain levels in this class, as shown in the Infusions Known column of the Artificer table. \n \n Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one. \n \n Infusing an Item - Whenever you finish a long rest, you can touch a non-magical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion’s description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement (see “Attunement” in chapter 7 of the Dungeon Master’s Guide). \n \n Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one. \n \n You can infuse more than one nonmagical object at the end of a long rest; the maximum number of objects appears in the Infused Items column of the Artificer table. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of infusions, the oldest infusion immediately ends, and then the new infusion applies. \n \n If an infusion ends on an item that contains other things, like a bag of holding, its contents harmlessly appear in and around its space."
            },
            {
                "name": "Artificer Specialist",
                "description": "Artificers pursue many disciplines. At 3rd level you can choose a specialist option."
            },
            {
                "name": "The Right Tool for the Job",
                "description": "At 3rd level, you learn how to produce exactly the tool you need: with thieves’ tools or artisan’s tools, you can magically create one set of artisan’s tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again."
            },
            {
                "name": "Ability Score Improvement",
                "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature. Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead."
            },
            {
                "name": "Tool Expertise",
                "description": "Starting at 6th level, your proficiency bonus is doubled for any ability check you make that uses your proficiency with a tool."
            },
            {
                "name": "Flash of Genius",
                "description": "Starting at 7th level, you gain the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll. \n \n You can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest."
            },
            {
                "name": "Magic Item Adept",
                "description": "When you reach 10th level, you achieve a profound understanding of how to use and make magic items: \n \n - You can attune to up to four magic items at once. \n - If you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold."
            },
            {
                "name": "Spell-Storing Item",
                "description": "At 11th level, you learn how to store a spell in an object. Whenever you finish a long rest, you can touch one simple or martial weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a 1st- or 2nd-level spell from the artificer spell list that requires 1 action to cast (you needn’t have it prepared). \n \n While holding the object, a creature can take an action to produce the spell’s effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it’s been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object."
            },
            {
                "name": "Magic Item Savant",
                "description": "At 14th level, your skill with magic items deepens more: \n \n - You can attune to up to five magic items at once. \n - You ignore all class, race, spell, and level requirements on attuning to or using a magic item."
            },
            {
                "name": "Magic Item Master",
                "description": "Starting at 18th level, you can attune to up to six magic items at once."
            },
            {
                "name": "Soul of Artifice",
                "description": "At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection: \n \n - You gain a +1 bonus to all saving throws per magic item you are currently attuned to. \n - If you’re reduced to 0 hit points but not killed out-right, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0."
            }
        ],
        "savingthrowproficiencies": [
            {
                "attribute": "Constitution",
                "proficiencylevel": "Proficient"
            },
            {
                "attribute": "Intelligence",
                "proficiencylevel": "Proficient"
            }
        ],
        "hitdie": "1d8"
    }
]
